Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: gone forth in my very doctrine,

source: དེར་དེའི་ཕ་མ་གཉིས་དང་མཛའ་སྡེ་བོ་དེ་རྣམས་ཀྱིས་ཀྱང་སྨོན་ལམ་བཏབ་པ་དེས་ན།
en: “At that time his parents and the social club also said that prayer,

source: ད་ལྟར་ཡང་འདི་ཁོ་ན་ལ་བརྟེན་ནས། འདི་རྣམས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་སོ།། །།
en: and so it is that now they have pleased me, and not displeased me.”

source: འཐབ་པ་ཞེས་བྱ་བ་ནི།
en: The Attack

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་ཡུལ་ཀོ་ས་ལ་དང་། ཡུལ་མ་ག་དྷཱའི་བར་མཚམས་ན། སེང་གེ་མཐུ་རྩལ་བདོ་བ་གཉིས་འདུག་སྟེ།
en: When the Blessed One was in Śrāvastī, two mighty, agile, and ferocious lions lived at the border between Kośala and Magadha.

source: དེ་གཉིས་དེ་ན་འདུག་པས། སྐྱེ་བོ་མང་པོ་ཁ་འདོག་པར་བྱེད་དེ། འདྲུལ་བཅད་དོ། །
en: While they stayed there they killed a great many people

source: དེ་གཉིས་ཀྱིས་ལམ་ཆོད་པས། སུ་ཡང་ལམ་དེར་འགྲོ་མི་ནུས་པར་གྱུར་ཏོ། །
en: and cut off all passage along the road so that no one was able to travel by it.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་། ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི། ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་ངས་ངན་སོང་ནས་ཕྱུང་སྟེ། མཐོ་རིས་དང་། ཐར་པ་དང་འབྲས་བུ་ལ་གཞག་པར་བྱ།
en: Whom shall I pull up from the lower realms, and establish in the resultant state of heaven and liberation?

source: སུ་ནི་དགེ་བའི་རྩ་བ་རྣམས་སྨིན་པ་ལས་ཡེ་ཤེས་ཀྱི་མཚོན་གྱིས་བརྟོལ་བར་བྱ།
en: Whom, having already ripened their roots of virtue, shall I slice open with the blade of wisdom?

source: རྒྱ་མཚོ་ཆུ་སྲིན་རྣམས་ཀྱི་གནས། དུས་རླབས་ཡོལ་བར་འགྱུར་ཡང་སྲིད། །
en: The ocean, home of creatures fierce, Could fail to send its tides on time.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སེང་གེ་དེ་གཉིས་འདུལ་བའི་དུས་ལ་བབ་པར་དགོངས་ནས།
en: The Blessed Buddha saw the time had come to tame the two lions.

source: ཀུན་དགའ་བོ་ཁྱོད་སོང་ལ་དགེ་སློང་རྣམས་ལ། བཅོམ་ལྡན་འདས་ཡུལ་མ་ག་དྷཱ་ཕྱོགས་སུ་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་ཀྱིས།
en: “Ānanda, go and give the message to the monks that the Tathāgata will travel to Magadha.

source: སུ་བཅོམ་ལྡན་འདས་དང་ལྷན་ཅིག་ཏུ་ལྗོངས་རྒྱུ་ཞིང་འགྲོ་འདོད་པ་དེ་དག་ཆོས་གོས་ལོང་ཤིག་ཅེས་བསྒོ་ཤིག་ཅེས་བཀའ་སྩལ་ནས
en: Inform them that those who wish to travel with the Tathāgata should prepare their robes.”

source: བཅོམ་ལྡན་འདས་དབྱར་གནས་ཤིང་། དབྱར་བཞུགས་ནས། དགེ་སློང་མང་པོས་ཞམ་རིང་བྱས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས། རྒྱལ་པོའི་ཁབ་ཏུ་ཆས་ཏེ།
en: After having stayed there during the rains, the Blessed One then set out for Rājagṛha, surrounded and attended by an assembly of monks.

source: མཐར་གྱིས་རྒྱུ་ཞིང་གཤེགས་གཤེགས་ནས། སེང་གེའི་ནགས་ཁུང་དུ་བྱོན་ནས།
en: In going for alms they eventually came to the lions’ forest den.

source: སེང་གེ་དེ་གཉིས་ཟས་ཚོལ་དུ་སོང་སོང་བ་ལས། དེ་གཉིས་ཕྲད་ནས་འཐབ་པར་ཆས་སོ། །
en: The two lions were ranging about in search of food, and when they happened upon the monks, they prepared to attack.

source: བཅོམ་ལྡན་འདས་ཀྱང་དེ་གཉིས་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་མདུན་ལོགས་སུ་གཞེས་སོ། །
en: Out of compassion for them both, the Blessed One took his place in front of them.

source: དེ་ནས་ཐག་རིང་པོ་ཞིག་ནས། སེང་གེ་དེ་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: The lions saw the Blessed One from a distance,

source: མཐོང་ནས་ཀྱང་སེང་གེ་གཉིས་ཁྲོ་བའི་ཀུན་ནས་དཀྲིས་པ་མེད་པར་གྱུར་ཏེ།
en: and upon seeing him their fury disappeared

source: བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ནས།
en: and they felt a surge of joy toward the Blessed One.

source: དེ་གཉིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: They approached the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་དུ་བལྟ་ཞིང་འདུག་གོ། །
en: and sat gazing at his countenance.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་གཉིས་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One spoke to them, saying,

source: བཞིན་བཟངས་ཁྱེད་གཉིས་སྔོན་གྱི་ཉེས་པར་སྤྱོད་པའི་ལས་ཀྱིས་དུད་འགྲོའི་ནང་དུ་སྐྱེས་ན།
en: “My friends, you have taken birth in the lower realms because of your past wrongful ways.

source: ཁྱེད་གཉིས་ད་ལྟར་ཡང་དེ་འབའ་ཞིག་གི་རྒྱུ་བྱེད་ཅིང་འདུག་གོ། །
en: Even now you are creating nothing but such causes.

source: བཞིན་བཟངས་གཉིས་འདི་ལྟར་འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་གོ། །
en: “So it is, my friends: all compounded things are impermanent.

source: དུད་འགྲོའི་སྐྱེ་གནས་དང་བྲལ་བར་འགྱུར་ཡང་སྲིད་དོ་ཞེས་བཀའ་སྩལ་ནས།
en: and you may even be released from rebirth in the animal realm.”

source: བཅོམ་ལྡན་འདས་གཤེགས་སོ། །
en: Having spoken thus, the Blessed One departed.

source: དེ་གཉིས་བཅོམ་ལྡན་འདས་ལས་ཆོས་ཐོས་ནས་ཁ་འཚོས་སོ། །
en: Upon hearing this Dharma from the Blessed One, the two lions were pleased.

source: དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པ་རྣམས་ནི་མེའི་དྲོད་ཆེ་སྟེ།
en: Those who take birth in the animal realms are predisposed to feelings of warmth,

source: བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བ་བསྐྱེད་བཞིན་དུ་ཤི་ནས་ལྷའི་ནང་དུ་སྐྱེས་སོ། །
en: so when they passed away, filled with joy at the thought of the Blessed One, they took rebirth among the god realms.

source: ལྷའི་བུའམ་ལྷའི་བུ་མོ་སྐྱེས་མ་ཐག་པ་ནི། ཆོས་ཉིད་ཀྱིས་སེམས་རྣམ་པ་གསུམ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Now when young gods and goddesses are born they possess three different types of innate knowledge.

source: བདག་གང་ནས་ཤི་འཕོས་གང་དུ་སྐྱེ། ལས་གང་གིས་སྐྱེས་སྙམ་མོ། །
en: They know (1) whence they have died and transmigrated, (2) where they have been born, and (3) why they have taken birth there.

source: དེ་ནས་དུད་འགྲོ་ལས་ཤི་འཕོས་པ་དང་། ལྷའི་ནང་དུ་སྐྱེས་པ་དང་། བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བར་གྱུར་པ་དེ་གཉིས་ཀྱིས་མཐོང་ངོ་། །
en: They saw that when they had died as animals, filled with joy at the thought of the Blessed One, they transmigrated and took rebirth as gods.

source: དེ་ནས་དེ་གཉིས་ཀྱིས་བསམ་པ།
en: Then they thought,

source: བདག་ཅག་གཉིས་ཞག་ལོན་ནས། གཟོད་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོ་བ་ནི།
en: “It’s been a whole day since we approached the Blessed One and offered him our respect.

source: བདག་ཅག་གཉིས་ཀྱི་ཆ་མ་ཡིན་གྱི།
en: This isn’t proper of us.

source: བདག་ཅག་གཉིས་ཞག་མ་ལོན་པར་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོའོ་སྙམ་མོ། །
en: Not a day should pass without our seeing the Blessed One.”

source: དེ་ནས་སྔོན་སེང་གེར་གྱུར་པའི་ལྷའི་བུ་རྣ་ཆ་གདུབ་ཀོར་དག་ཅིང་མགུལ་རྒྱན་ཐོགས་པ། ལུས་དོ་ཤལ་དང་། སེ་མོ་དོས་བརྒྱན་པ། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་ཅོད་པན་ཅན་ལུས་གུར་གུམ་དང་། ཏ་མ་ལའི་ལོ་མ་དང་། སྤྲྀ་ཀ་ལ་སོགས་པས་བྱུགས་པ་དེ་གཉིས་ཀྱིས་དེ་ཉིད་ཀྱི་མཚན་མོ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་བ་དག་གིས་ཐུ་བ་བཀང་སྟེ
en: So the young gods who formerly were lions decorated themselves with earrings, garlands, and strings of precious stones, put on crowns decorated with various types of precious jewels, and perfumed their bodies with saffron, tamala, spṛka, and other herbs. That night they filled the front of their long shirts with divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers.

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཐམས་ཅད་འོད་ཆེན་པོས་སྣང་བར་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་གིས་གཏོར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: Then, appearing amid a great light in the garden of Prince Jeta, they scattered the flowers over the Blessed One, touched their heads to the Blessed One’s feet,

source: ཆོས་ཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་གཉིས་ལ་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: Then the Blessed One taught them the Dharma particularly suited to them,

source: དེ་གཉིས་ཀྱིས་ཆོས་ཐོས་ནས་བདེན་པ་མཐོང་བར་གྱུར་ཏེ།
en: and upon hearing the Dharma they saw the truths.

source: དེ་གཉིས་ཀྱིས་བདེན་པ་མཐོང་ནས་རང་གི་གནས་སུ་སོང་ངོ་། །
en: After they had seen the truths they went back to where they belonged.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་པ་མཐོང་ནས། བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: The monks, having noticed the great rays of light spreading forth from the garden of Prince Jeta, inquired of the Blessed One,

source: མདང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ། འཇིག་རྟེན་སྐྱོང་བ་བཞིའམ། ལྷའི་བུ་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་གཞན་འགའ་ཞིག །བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་སླད་དུ་མཆིས་ལགས་སམ།
en: Last night, did Sahāṃpati Brahmā, or Śakra, King of the Gods—or perhaps the four great kings, or some other young god of great miracles and great power—come to offer respect to the Blessed One?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་མདང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ། འཇིག་རྟེན་སྐྱོང་བ་བཞིའམ། ལྷའི་བུ་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་གཞན་འགའ་ཞིག་ང་བལྟ་བའི་ཕྱིར་འོངས་པ་མ་ཡིན་གྱིས།
en: “Monks,” the Blessed One told them, “last night it was neither Sahāṃpati Brahmā, nor Śakra, King of the Gods, nor the four great kings, nor some other young god of great miracles and great power who came to see me.

source: དགེ་སློང་དག་ཁྱེད་ཀྱིས་ནགས་ཁུང་དགོན་པ་ན། སེང་གེ་གཉིས་ཕན་ཚུན་འཐབ་ཅིང་འདུག་པ་མཐོང་ངམ།
en: Monks, did you see the two lions who attacked us from that deep forest den?”

source: བཀའ་སྩལ་པ། ངས་དེ་གཉིས་ལ་ཆོས་བསྟན་ཏེ།
en: The Blessed One then explained,

source: དེ་གཉིས་ཀྱིས་ང་ལས་ཆོས་ཐོས་ནས་ཁ་འཚོས་ཏེ། དེ་གཉིས་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་པ་ལས་ལྷའི་ནང་དུ་སྐྱེས་ཏེ་ལྷར་གྱུར་ནས།
en: “I taught them the Dharma, and upon hearing the Dharma from me they were pleased, whereupon they died, transmigrated, and took rebirth among the gods.

source: ངའི་ཐད་དུ་འོངས་ཏེ། དེ་གཉིས་ལ་ངས་ཆོས་བསྟན་ནས།
en: As gods they came to me and I taught them the Dharma.

source: ང་ལས་ཆོས་ཐོས་པ་དེས་ན། དེ་དག་གིས་བདེན་པ་རྣམས་མཐོང་སྟེ།
en: Having heard the Dharma from me they saw the truths,

source: དེ་གཉིས་ཀྱིས་བདེན་པ་མཐོང་ནས། རང་གི་གནས་སུ་སོང་ངོ་། །
en: and having seen the truths they went back to where they belonged.”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་སེང་གེ་དེ་གཉིས་ཀྱི་ཁོན་བྱང་བར་མཛད་དེ།
en: “Lord,” the monks requested of the Blessed Buddha, “tell us why the Blessed One purified the hostility of those two lions and

source: མཐོ་རིས་དང་ཐར་པ་ཐོབ་པར་མཛད་ལ། ཡུལ་འཁོར་གཉིས་ཀྱི་འཇིགས་པ་བསལ་བ་ལ་གཟིགས།
en: led them to attain the god realms and liberation, dispelling the fears of two countries.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་ངས་འདི་གཉིས་ཀྱི་ཁོན་བྱང་བར་བྱས་ནས།
en: “Not only now,” the Blessed One explained, “but in times past as well I purged them of hostility and

source: བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་དེ། ཡུལ་འཁོར་གཉིས་ཀྱི་འཇིགས་པ་ཡང་ཅི་ལྟར་བསལ་བ་དེ་ཉོན་ཅིག །
en: placed them in the four meditative states and the five superknowledges, dispelling the fears of two countries. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། ཡུལ་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་དང་། བི་དེ་ཧའི་རྒྱལ་པོ་དབང་ཆེན་སྡེ་གཉིས་ཕན་ཚུན་མི་འཐུན་པར་གྱུར་ནས།
en: “Monks, in times gone by, King Brahmadatta reigned in the city of Kāśi, and King Mahendrasena reigned in the city of Videha. The two did not agree with one another,

source: དེ་གཉིས་ཀྱིས་དུས་དུས་སུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཁ་འདོག་པར་བྱེད་དོ། །
en: and from time to time a great many people were killed.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་གཉིས་ཀྱིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས། གཡུལ་འགྱེད་པར་འདོད་པའི་ཕྱིར། ས་མཚམས་ན་འཁོད་དོ། །
en: “One day they arrayed the four divisions of their armies, and, wishing to wage war, they hunkered down at the border of their two countries.

source: དེ་གཉིས་འཁོད་པའི་འདབ་ན་དཀའ་ཐུབ་ཀྱི་གནས་ཞིག་ན། དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ། རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་གནས་པ་དེས།
en: A certain sage who had all the five superknowledges and was a person of great miracles and great power lived in a place devoted to austerities near where they were hunkered down.

source: དེ་གཉིས་ལ་སྙིང་བརྩེ་བའི་ཕྱིར། སྟེང་གི་ནམ་མཁའ་ལ་འོངས་ནས། དེ་གཉིས་ཀྱི་བར་མཚམས་སུ་འདུག་གོ། །
en: Out of compassion for both of the kings, he traveled through the sky to sit between them on the border.

source: དེ་ནས་དྲང་སྲོང་དེ་མཐོང་ནས་དེ་གཉིས་ཀྱི་ཁྲོ་བའི་ཀུན་ནས་དཀྲིས་པ་མེད་པར་གྱུར་ནས། དྲང་སྲོང་དེ་ལ་ཤས་ཆེར་དགའ་བར་གྱུར་ཏོ། །
en: Upon seeing the sage, their fury disappeared, and instead they were filled with the greatest admiration for the sage.

source: དེ་གཉིས་དགའ་བར་གྱུར་ནས། དྲང་སྲོང་དེ་ལ་སྨྲས་པ།
en: In joy they asked the sage,

source: བཀའ་སྩལ་པ་ཅི་མཆིས།
en: ‘Sage, what advice can you grant us?’

source: དྲང་སྲོང་དེས་སྨྲས་པ།
en: “The sage said to them,

source: ཁོན་བྱང་བར་གྱིས་ཤིག །
en: ‘You must purge all your hostility.’

source: རྒྱལ་པོ་དེ་གཉིས་ཀྱིས་སྨྲས་པ།
en: “The two kings replied,

source: དྲང་སྲོང་གིས་ཅི་སྐད་བཀའ་སྩལ་པ་དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་སྨྲས་ནསམཇལ་དུམ་བྱས་ཏེ། དྲང་སྲོང་གི་རྐང་པ་ལ་ཕྱག་འཚལ་ནས།
en: ‘As you wish, sage,’ and, coming to an agreement, they bowed down at the sage’s feet

source: ཆོས་ཉན་པའི་ཕྱིར། དྲང་སྲོང་གི་མདུན་དུ་འདུག་གོ། །
en: and sat before him to listen to the Dharma.

source: དྲང་སྲོང་དེས་ཀྱང་དེ་གཉིས་ལ་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏོ། །
en: Then the sage taught them the Dharma particularly suited to them,

source: དེ་ནས་རྒྱལ་པོ་དེ་གཉིས་ཀྱིས་སོ་སོའི་བུ་རབ་རྒྱལ་སར་བཅུག་ནས།
en: and the kings ceded their thrones to their children,

source: དྲང་སྲོང་དེ་ཉིད་ཀྱི་ཐད་དུ་རབ་ཏུ་བྱུང་སྟེ།
en: went forth in the presence of that very sage,

source: བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: and generated the four meditative states and the five superknowledges.

source: དེའི་ཚེ་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་དང་། བི་དེ་ཧའི་རྒྱལ་པོ་དབང་ཆེན་སྡེར་གྱུར་པ་གང་ཡིན་པ་དེ་གཉིས་ནི། སེང་གེ་འདི་གཉིས་ཁོ་ན་ཡིན་ཏེ
en: Those who were King Brahmadatta of Kāśi and King Mahendrasena of Videha are none other than those two lions.

source: དེའི་ཚེ་ཡང་ངས་འདི་གཉིས་ཀྱི་ཁོན་བྱང་བར་བྱས་ནས་རབ་ཏུ་བྱུང་སྟེ།
en: At that time I rid them of hostility and

source: ད་ལྟར་ཡང་ངས་འདི་གཉིས་ཀྱི་ཁོན་བྱང་བར་བྱས་ནས།
en: Now as well I have rid them of hostility and

source: མཐོ་རིས་དང་ཐར་པ་ཐོབ་པར་བྱས་སོ། །
en: led them to the god realms and liberation.”

source: གསོལ་པ། བཙུན་པ་འདི་གཉིས་ཀྱིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་སེང་གེར་སྐྱེས་ལགས།
en: “Lord,” the monks inquired, “what action did they take that ripened into their birth as lions?

source: ལས་ཅི་བགྱིས་ན། དེ་ནས་ཤི་འཕོས་ནས་ལྷའི་ནང་དུ་སྐྱེས་ལ་འདི་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: What action did they take that, after they died, they transmigrated and took rebirth among the gods, and that they pleased the Blessed One, and did not displease him?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདས་པའི་ལས་ཀྱང་ཡོད། ད་ལྟར་གྱི་ལས་ཀྱང་ཡོད་དེ།
en: “Monks,” the Blessed One replied, “it was partly their past actions, and it is partly their present actions as well.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་འདི་གཉིས་དགེ་བསྙེན་དུ་གྱུར་ཏེ། ཁ་མི་མཁས་པ་དེས། འདི་གཉིས་ཁྲོས་པས། སྐྱེ་བོ་མང་པོ་ལ་དུད་འགྲོ་ཞེས་བྱ་བའི་ཚིག་སྨྲས་ལ།
en: As lay vow holders in the teaching of the totally and completely awakened Buddha Kāśyapa, lacking discernment they spoke in anger to many people, calling them animals.

source: དེར་འདི་གཉིས་ཀྱིས་ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ནས། འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: Then, after going for refuge and keeping the fundamental precepts all their lives, at the time of their deaths they prayed,

source: དེའི་ཚེ་དགེ་བསྙེན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་གཉིས་ནི། སེང་གེ་འདི་གཉིས་ཁོ་ན་ཡིན་ཏེ།
en: The ones who were the lay vow holders then are none other than these lions.

source: དེ་གཉིས་ཀྱིས་དེར་སྐྱེ་བོ་མང་པོ་ལ་དུད་འགྲོ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་དུད་འགྲོར་སྐྱེས་སོ། །
en: The act of calling many people animals ripened into their births as animals.

source: དེ་གཉིས་ཀྱིས་དེར་ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ནས། འཆི་ཀར་སྨོན་ལམ་བཏབ་པ་དེས་ནི།
en: Then they went for refuge and maintained the fundamental precepts, and said that prayer at the time of their deaths.

source: འདི་གཉིས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་པ་འདི་ནི་འདས་པའི་དུས་ཀྱི་ལས་ཡིན་ནོ། །
en: that they have pleased me and not displeased me. These were their past actions.

source: འདི་གཉིས་སེང་གེར་གྱུར་ནས། ང་ལ་སེམས་དགའ་བར་བྱས་པ་དེས་ན་ལྷའི་ནང་དུ་སྐྱེས་ཏེ།
en: As lions, because they were filled with joy at the thought of me, they took birth among the gods.

source: རྙིས་བཟུང་བ་ཞེས་བྱ་བ་ནི།
en: Trapped

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན། ནགས་ཁྲོད་ཅིག་ན། རི་དགས་ཀྱི་རྔོན་པ་དག་ཅིག་གིས་རི་དགས་བཤོར་པའི་ཕྱིར་རྒྱ་དང་རྙི་དང་། འཇོལ་རླུབས་དང་། རྙི་མང་པོ་དག་བཙུགས་ནས། དེར་རི་དགས་མང་པོ་ཞིག་བཟུང་ངོ་། །
en: When the Blessed One was in Śrāvastī, there were certain hunters in the forests of Śrāvastī who had set out many nets, machine traps, and pit traps to hunt deer, and managed to catch a great number of deer.

source: རྔོན་པ་དེ་དག་ཀྱང་ནང་པར་སྔར་ལངས་ཏེ། ནགས་ཁྲོད་དེར་སོང་ནས།
en: In the morning they rose and went to the forest,

source: དེ་དག་གིས་དེར་རི་དགས་ཅི་ཟིན་པ་རྣམས་མདའ་འཕངས་ཏེ་བསད་ནས། དེ་དག་ལས་ཉུང་ཤས་ཅིག་ལུས་སོ། །
en: and when they saw the deer they had caught, they began to shoot and kill them with arrows, until only a few remained.

source: དེའི་ཚེ་ས་ཕྱོགས་དེར་བཅོམ་ལྡན་འདས་ཀྱང་གཤེགས་སོ། །
en: At that time the Blessed One was traveling through the region,

source: དེ་ནས་རི་དགས་དེ་རྣམས་དང་། རྔོན་པ་དེ་རྣམས་ཀྱིས་ཐག་རིང་པོ་ཞིག་ནས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: and the deer and the hunters all saw the Blessed One from a distance.

source: དགའ་བར་གྱུར་ནས། རྔོན་པ་དེ་དག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: In their joy the hunters approached the Blessed One,

source: དེས་ན་རྔོན་པ་དེ་རྣམས་ཀྱིས་སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: the hunters manifested the resultant state of stream entry right where they sat.

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས། གསོལ་པ།
en: After they saw the truths, they requested the Blessed One,

source: བཙུན་པ་བདག་ཅག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་ཞིང་། དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, if permitted we wish to go forth in the Dharma and Vinaya so well spoken, complete our novitiates, and achieve full ordination.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ།
en: With the words “Come, join me, monks!” the Blessed One led them to go forth as novices,

source: དེ་དག་ལ་ལུང་ཡང་ཕོག་སྟེ།
en: and instructed them.

source: དེ་དག་གིས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ།
en: They cast away all afflictive emotions through diligence, practice, and effort, and manifested arhatship.

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །རི་དགས་དེ་རྣམས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བཞིན་དུ་ཤི་འཕོས་ཏེ།
en: Then, filled with joy at the thought of the Blessed One, the deer died, transmigrated,

source: དུས་ལས་འདས་ནས་ལྷའི་ནང་དུ་སྐྱེས་སོ། །
en: and took rebirth among the gods.

source: བདག་གང་ནས་ཤི་འཕོས། གང་དུ་སྐྱེས། ལས་གང་གིས་སྐྱེས་སྙམ་མོ། །
en: They know (1) whence they have died and transmigrated, (2) where they have been born, and (3) why they have taken birth there.

source: དེ་ནས་དུད་འགྲོ་ལས་ཤི་འཕོས་པ་དང་ལྷའི་ནང་དུ་སྐྱེས་པ་དང་། བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བར་གྱུར་པ་དེ་དག་གིས་མཐོང་ངོ་། །
en: They saw that when they had died as animals, filled with joy at the thought of the Blessed One, they had transmigrated and taken rebirth as gods.

source: དེ་ནས་དེ་དག་གིས་བསམས་པ།
en: Thereupon they thought,

source: བདག་ཅག་ཞག་ལོན་ནས་གཟོད་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོ་བ་ནི་བདག་ཅག་གི་ཆ་མ་ཡིན་གྱིས།
en: “It’s been a whole day since we went to see the Blessed One. This isn’t proper of us.

source: བདག་ཅག་ཞག་མ་ལོན་པར་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོའོ་སྙམ་མོ། །
en: Not a day should pass without our seeing the Blessed One.”

source: དེ་ནས་སྔོན་རི་དགས་སུ་གྱུར་པའི་ལྷའི་བུ་རྣ་ཆ་གདུབ་ཀོར་དག་ཅིང་མགུལ་རྒྱན་ཐོགས་པ། ལུས་དོ་ཤལ་དང་སེ་མོ་དོས་བརྒྱན་པ། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་ཅོད་པན་ཅན་ལུས་གུར་གུམ་དང་། ཏ་མ་ལའི་ལོ་མ་དང་སྤྲྀ་ཀ་ལ་སོགས་པས་བྱུག་པ་དག་གིས་དེ་ཉིད་ཀྱི་མཚན་མོ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་བ་རྣམས་ཀྱིས་ཐུ་བ་བཀང་སྟེརྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཐམས་ཅད་འོད་ཆེན་པོས་སྣང་བར་བྱས་ནས།
en: So the young gods who formerly were animals decorated themselves with earrings, garlands, and strings of precious stones, put on crowns decorated with various types of precious jewels, and perfumed their bodies with saffron, tamala, spṛka, and other herbs. That night they filled the front of their long shirts with divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers, and they approached the Blessed One,

source: བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་གིས་གཏོར་ཏེ།
en: scattered the divine flowers over the Blessed One,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏོ། །
en: The Blessed One taught them the Dharma particularly suited to them,

source: དེ་དག་གིས་ཆོས་ཐོས་ནས་བདེན་པ་མཐོང་བར་གྱུར་ཏེ།
en: and upon hearing the Dharma they saw the truths.

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས་རང་གི་གནས་སུ་དོང་ངོ་། །
en: Having seen the truths, they went back to where they belonged.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་པ་མཐོང་ནས། བཅོམ་ལྡན་འདས་ལ་ཞུས་པ་བཅོམ་ལྡན་འདས་ཅི་ལགས།
en: Having noticed the great rays of light spreading forth from the garden of Prince Jeta, the monks inquired of the Blessed One, “Blessed One, what was this?

source: མདང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ། འཇིག་རྟེན་སྐྱོང་བ་བཞིའམ། ལྷའི་བུ་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་གཞན་འགའ་ཞིག་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་སླད་དུ་མཆིས་ལགས་སམ།
en: Last night, did Sahāṃpati Brahmā, or Śakra, King of the Gods—or perhaps the four great kings, or some other young god of great miracles and great power—come to offer respect to the Blessed One?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་མ་དང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ། འཇིག་རྟེན་སྐྱོང་བ་བཞིའམ་ལྷའི་བུ་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་གཞན་འགའ་ཞིག་ང་ལ་བལྟ་བའི་ཕྱིར་འོངས་པ་མ་ཡིན་གྱིས།
en: “Monks,” the Blessed One explained, “last night it was neither Sahāṃpati Brahmā, nor Śakra, King of the Gods, nor the four great kings who came to see me, nor some other young god of great miracles and great power.

source: དགེ་སློང་དག་ཁྱོད་ཀྱིས་ནགས་ཁུང་དགོན་པ་ན། རི་དགས་ལྔ་བརྒྱ་རྔོན་པ་རྣམས་ཀྱིས་མདའ་འཕངས་ཏེ་བསད་པ་མཐོང་ངམ།
en: Monks, did you see the five hundred deer shot and killed with arrows in that deep hollow of the forest?”

source: བཀའ་སྩལ་པ། དེ་དག་ང་ལ་སེམས་དགའ་བར་གྱུར་བཞིན་དུ་ཤི་འཕོས་ནས་དུས་ལས་འདས་པ་ལས་ལྷའི་ནང་དུ་སྐྱེས་ཏེ
en: “They died filled with joy at the thought of me, transmigrated, and took rebirth among the gods,” said the Blessed One.

source: ལྷར་གྱུར་ནས་ངའི་ཐད་དུ་འོངས་ཏེ། དེ་དག་ལ་ངས་ཆོས་བསྟན་ནས།
en: “As gods they came to see me and I taught them the Dharma.

source: ང་ལས་ཆོས་ཐོས་པ་དེས་ན་དེ་དག་གིས་བདེན་པ་རྣམས་མཐོང་སྟེ།
en: After they had heard the Dharma from me they saw the truths,

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས། རང་གི་གནས་སུ་སོང་ངོ་། །
en: and having seen the truths they went back to where they belonged.”

source: བཙུན་པ་རྔོན་པ་དེ་དག་གིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་གདོལ་པའི་རིགས་སུ་སྐྱེས་ལགས།
en: “Lord, what actions did the hunters take that ripened into their births as persons of low class?
